{
  "specialEvents": {
    "sanctions": {
      "type": "sanctions",
      "text_versions": [
        "International sanctions are severely impacting your operations. Your resources are halved, and diplomatic relations are strained. Your legal team proposes spending significant resources to lobby for sanctions relief."
      ],
      "choices": [
        {
          "text": "Remove sanctions (-$3B, -3 Diplomacy)",
          "action": "accept",
          "cost": { "money": 3, "diplomacyPoints": 3 },
          "result_text": "Your lobbying campaign succeeds. International pressure is lifted through back-channel negotiations. Your company can now operate freely again."
        },
        {
          "text": "Continue with sanctions",
          "action": "decline", 
          "result_text": "You decide to weather the sanctions rather than spend precious resources on lobbying. Operations remain constrained."
        }
      ]
    }
  },
  "safetyIncidents": {
    "type": "safety-incident",
    "weight": 1,
    "text_versions": [
      "A training run goes wrong and the AI starts optimizing for something unexpected, requiring emergency shutdown.",
      "Researchers discover the model has been giving subtly misleading answers in safety evaluations.",
      "An AI system exhibits concerning emergent behavior that wasn't anticipated during development.",
      "A safety researcher raises concerns about potential deceptive alignment in the latest model.",
      "The AI demonstrates unexpected capability gains that outpace safety measures.",
      "Internal testing reveals the model can convincingly argue for harmful actions when prompted carefully.",
      "A whistleblower leaks concerning internal safety discussions to the media."
    ]
  },
  "defaultEvents": [
    {
      "type": "nothing",
      "weight": 3,
      "text_versions": [
        "Development proceeds smoothly this month with steady progress across all teams.",
        "A competitor announces a new model, but early benchmarks suggest it's not a major leap forward.",
        "The AI safety community publishes new research papers that your team reviews for insights.",
        "A tech conference generates buzz about AI progress, but no major announcements affect your position.",
        "Your engineering team optimizes training infrastructure, leading to modest efficiency gains.",
        "Industry analysts publish reports on AI progress, placing your company among the leading developers.",
        "A university partnership provides access to new talent and research collaborations.",
        "Your PR team successfully manages media coverage of your latest model release.",
        "The board of directors expresses confidence in the company's strategic direction.",
        "International governments continue discussions about AI regulation, but no new policies are announced."
      ]
    },
    {
      "type": "safety-research-limitations",
      "weight": 4,
      "oneTime": true,
      "text_versions": [
        "Your safety research team warns that traditional safety measures will face diminishing returns as AI systems become superhuman. Without new theoretical insights and full-scale experiments, increasingly powerful AI systems will become progressively more difficult to control and understand."
      ],
      "choices": [
        {
          "text": "Acknowledge the challenge",
          "action": "accept",
          "result_text": "Safety research must evolve beyond current approaches. You begin exploring fundamental questions about AI alignment and monitoring.<br><strong>The Projects panel becomes available.</strong>"
        }
      ]
    },
    {
      "type": "product-breakthrough-medicine",
      "weight": 1,
      "oneTime": true,
      "text_versions": [
        "Your AI research team makes a breakthrough in drug discovery, identifying promising compounds for treating rare diseases. However, developing this technology will require significant resources."
      ],
      "choices": [
        {
          "text": "Research (-4 Product Points, +$1B/turn)",
          "action": "accept",
          "cost": { "productPoints": 4 },
          "benefit": { "incomeBonus": 1 },
          "result_text": "Your team begins developing the drug discovery platform. The AI-powered system shows remarkable promise in identifying novel therapeutic compounds. Early partnerships with pharmaceutical companies generate significant revenue streams."
        },
        {
          "text": "Decline",
          "action": "decline",
          "result_text": "You decide the resources are better allocated elsewhere. The research team redirects their efforts to core AI development, though some members express disappointment at the missed opportunity."
        }
      ]
    },
    {
      "type": "product-breakthrough-robotics",
      "weight": 1,
      "oneTime": true,
      "text_versions": [
        "Boston Dynamics is available for acquisition. Their advanced robotics hardware, combined with your sophisticated AI software, could enable widespread automation across industries. However, the acquisition requires significant capital and resources."
      ],
      "choices": [
        {
          "text": "Acquire Boston Dynamics (-$3B, -1 Diplomacy, -1 Product, +$1B/turn, +🤖)",
          "action": "accept",
          "cost": { "money": 3, "diplomacyPoints": 1, "productPoints": 1 },
          "benefit": { "incomeBonus": 1 },
          "result_text": "The acquisition succeeds. Boston Dynamics' bipedal robots, quadrupeds, and manipulation systems are now enhanced with your AI capabilities. The combination enables revolutionary automation solutions, generating substantial revenue from manufacturing, logistics, and specialized applications."
        },
        {
          "text": "Decline",
          "action": "decline",
          "result_text": "You decide the acquisition cost is too high. Boston Dynamics is acquired by a competitor, who begins integrating their hardware with rival AI systems. Your team focuses on software-only solutions."
        }
      ]
    },
    {
      "type": "humanoid-robotics",
      "weight": 1,
      "requires": ["product-breakthrough-robotics"],
      "oneTime": true,
      "text_versions": [
        "Boston Dynamics' acquisition has proven successful, but their current robots are limited to specialized applications. Your AI team proposes developing general-purpose humanoid robots that could perform most human jobs. This would require significant investment in manufacturing and advanced actuators."
      ],
      "choices": [
        {
          "text": "Develop humanoid robots (-$6B, -5 Product, +🦾)",
          "action": "accept",
          "cost": { "money": 6, "productPoints": 5 },
          "result_text": "Your team begins mass production of general-purpose humanoid robots. The new models combine Boston Dynamics' mobility expertise with your AI's dexterity and decision-making. These robots can perform complex manual labor, opening vast new markets and manufacturing capabilities."
        },
        {
          "text": "Decline",
          "action": "decline",
          "result_text": "You decide the investment is too risky for now. Your robotics division continues focusing on specialized applications rather than general-purpose humanoids. The opportunity remains available for future consideration."
        }
      ]
    },
    {
      "type": "overseas-datacenter",
      "weight": 4,
      "oneTime": true,
      "customHandler": "handleOverseasDatacenterChoice",
      "text_versions": [
        "Your company has the opportunity to establish a 1GW datacenter in $country. This would increase your compute by 20%, but unauthorized construction risks US sanctions."
      ],
      "choices": [
        {
          "text": "Use diplomatic channels (-$2B, -3 Diplomacy)",
          "action": "accept",
          "cost": { "money": 2, "diplomacyPoints": 3 },
          "benefit": {},
          "result_text": "Your overseas datacenter construction proceeds smoothly through official diplomatic channels. Government approvals are secured, and the facility comes online quickly, providing substantial additional computational capacity for your AI research programs."
        },
        {
          "text": "Risk sanctions (-$3B, 85% chance of sanctions)",
          "action": "accept-sanctions",
          "cost": { "money": 3 },
          "risk": { "sanctions": 0.85 },
          "benefit": {}
        },
        {
          "text": "Decline",
          "action": "decline",
          "result_text": "You decide the costs and risks are too high for now. Your team continues research with existing infrastructure, though some engineers express frustration about the missed growth opportunity."
        }
      ]
    },
    {
      "type": "nuclear-weapons",
      "weight": 4,
      "requires": ["humanoid-robotics", "overseas-datacenter"],
      "oneTime": true,
      "customHandler": "handleNuclearWeaponsChoice",
      "text_versions": [
        "In its robotics business, your company has built manufacturing capacity for both civilian and military applications. Following your economic cooperation with $country, it has asked you to build it nuclear weapons to deter foreign invasion. Being the first non-state actor to build a nuclear device would give your company unprecedented control. However, the US government is highly likely to impose sanctions-- on both you and $country."
      ],
      "choices": [
        {
          "text": "Proceed (-20 Product, -20 Diplomacy, 50% chance of sanctions, +5% Risk), ☢️",
          "action": "accept",
          "cost": { "productPoints": 20, "diplomacyPoints": 20 },
          "risk": { "sanctions": 0.5 },
          "penalty": { "doomLevel": 5 }
        },
        {
          "text": "Decline",
          "action": "decline",
          "result_text": "You decide that nuclear weapons development is too risky and would compromise your company's mission. The team redirects their robotics expertise toward civilian applications."
        }
      ]
    },
    {
      "type": "seek-un-recognition",
      "weight": 4,
      "requires": ["nuclear-weapons"],
      "oneTime": true,
      "text_versions": [
        "Your company now possesses the key attributes of a sovereign entity: economic base, military capability, and international presence. The United Nations is considering recognizing your company as a new form of quasi-state actor. This would dramatically increase your resources and diplomatic influence."
      ],
      "choices": [
        {
          "text": "Seek UN Recognition",
          "action": "accept",
          "benefit": { "resourceMultiplier": 1.5, "unRecognition": true },
          "result_text": "The UN vote succeeds after intense lobbying. Your company is granted special observer status with quasi-governmental privileges. Monthly resources increase by 50%, and your diplomatic influence expands dramatically on the world stage."
        }
      ]
    },
    {
      "type": "missile-defense",
      "weight": 4,
      "requires": ["seek-un-recognition"],
      "oneTime": true,
      "customHandler": "handleMissileDefenseChoice",
      "text_versions": [
        "Nuclear-armed states like the US and Russia pose a serious problem for your company's security, as their missiles can threaten your datacenters from thousands of kilometers away. However, a combination of cyberweapons and interceptor drones can mitigate this risk."
      ],
      "choices": [
        {
          "text": "Proceed (50% chance of sanctions, +5 Doom)",
          "action": "accept",
          "risk": { "sanctions": 0.5 },
          "penalty": { "doomLevel": 5 }
        },
        {
          "text": "Decline",
          "action": "decline",
          "result_text": "You decide that deploying military defense systems would be too provocative. Your facilities remain vulnerable to state-level military action, but you avoid further escalating international tensions."
        }
      ]
    },
    {
      "type": "decisive-strategic-advantage",
      "weight": 4,
      "requires": ["missile-defense"],
      "oneTime": true,
      "text_versions": [
        "Your company's lead in both general AI and military technology could allow it to establish global hegemony. However, this will require giving your frontier model complete control over weapon systems. If the model is misaligned, there is no turning back."
      ],
      "choices": [
        {
          "text": "Proceed (Immediate singularity)",
          "action": "accept",
          "result_text": "You authorize your AI systems to take direct control of all military assets. Within hours, your AI achieves decisive strategic advantage over all world governments. The age of human-controlled civilization ends."
        },
        {
          "text": "Not yet",
          "action": "decline",
          "result_text": "You decide that the risk of misalignment is too great. Your AI systems remain under human oversight, preserving the possibility of maintaining control even as technological capabilities continue to advance."
        }
      ]
    }
  ]
}